///Емельянов Сергей Вариант-21 Лаб-10 Задача-2
/*
Реализовать обработку одномерного массива данных с использованием шаблонного класса vector библиотеки STL,
стремясь к максимальному использованию методов класса vector и алгоритмов библиотеки STL.
*/


#include <iostream>
#include <vector>

using namespace std;

int main()
{
    cout << "Hello world!" << endl;
    return 0;
}
