///Емельянов Сергей Вариант-21 Лаб-10 Задача-3
/*
Реализовать коллекцию объектов класса, функционально идентичную коллекции, разработанной в лабораторной работе №5,
с использованием шаблонного класса list библиотеки STL.
*/


#include <iostream>
#include <list>

using namespace std;

int main()
{
    cout << "Hello world!" << endl;
    return 0;
}
